Revit 2027 API
ParameterTypeId.DimStyleAngularUnits Property
 "Units Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimStyleAngularUnits { get; }
Public Shared ReadOnly Property DimStyleAngularUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimStyleAngularUnits {
	ForgeTypeId^ get ();
}
static member DimStyleAngularUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace